{
    "html": "ACKS.html",
    "css": "ACKS.css",
    "authors": "Davemania",
    "roll20userid": "76",
    "preview": "ACKS.png",
    "instructions": "Sheet Design inspired by the [Lamentations of the Flame Princess sheet by Toni Ruiz](https://github.com/Roll20/roll20-character-sheets/tree/master/Lotfp).\n\n Sheet will not calculate Saving Throws or Attack Throw by Class and Level due to [Roll20 Guideline: No Character Creation or Advancement](https://github.com/Roll20/roll20-character-sheets#contributing). These values must be manually updated. Melee and Missile Attack Throws will be caluclated from there. Recommend adjusting the Saving Throw(s) up/down based on permant modifiers (wisdom) rather than manually entering the bonus each time it is rolled.\n\n Several actions granted by the Adventuring Proficiency are included by default. Racial modifiers are not automatically added, but the target number can be updated accordingly. Skills whose outcome may affect the metagame function by outputting a button for the GM to press, keeping the result hidden. This does not have to be used; these skills could be added in the regular action section underneath. Less frequently used default skills can be added. These include:\n * Fish at Sea 14+ * Hunt in the Wilderness 14+ * Ignite Oil without hurting oneself 2+\n\n Also included is a toggle to change the sheet over for monster statblocks. A monster statblock copied in the same format as the core rulebook will automatically be parsed, and the data can be quickly copied over to a small sheet which includes roll buttons for monster initiative, morale, saves and attacks. Entering the monsters full notation hit dice (eg. 1d8, or 3d8+3) in the attribute Mhitdice and using the [API script MonsterHitDice](https://wiki.roll20.net/Script:Monster_Hit_Dice) will enable automatic hitpoint rolling for tokens generated from the sheet.\n\nOptional House Rules Included:\n * Wisdom description suggests modifer to all Saving Throws, rather than just Saves vs Spells. User can modify Saving Throws to their preference. * Trained and Untrained Skills Throws are present and automatically calculated based on character level. [This progression was taken from here.](http://www.autarch.co/comment/9485#comment-9485)\n\nLastly, a roll template has been implemented and is used by the sheet roll buttons. A custom output can be created using the format &{template:acks_template} {{custom=1}} {{name=XXX}} {{XXX=YYY}} {{XXX=YYY}} {{XXX=YYY}}... etc."
}
